<?xml version="1.0"?>
<net name="frozen_model" version="6" batch="1">
	<layers>
		<layer name="input_1" type="Input" precision="FP32" id="0">
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="Conv1/Conv2D" type="Convolution" precision="FP32" id="1">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="0,0" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="128" />
				<weights offset="128" size="3456" />
			</blobs>
		</layer>
		<layer name="Conv1_relu/Relu6" type="Clamp" precision="FP32" id="2">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="expanded_conv_depthwise/depthwise" type="Convolution" precision="FP32" id="3">
			<data auto_pad="same_upper" dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3584" size="128" />
				<weights offset="3712" size="1152" />
			</blobs>
		</layer>
		<layer name="expanded_conv_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="4">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="expanded_conv_project/Conv2D" type="Convolution" precision="FP32" id="5">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4864" size="64" />
				<weights offset="4928" size="2048" />
			</blobs>
		</layer>
		<layer name="block_1_expand/Conv2D" type="Convolution" precision="FP32" id="6">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="6976" size="384" />
				<weights offset="7360" size="6144" />
			</blobs>
		</layer>
		<layer name="block_1_expand_relu/Relu6" type="Clamp" precision="FP32" id="7">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="block_1_depthwise/depthwise" type="Convolution" precision="FP32" id="8">
			<data dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="0,0" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<biases offset="13504" size="384" />
				<weights offset="13888" size="3456" />
			</blobs>
		</layer>
		<layer name="block_1_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="9">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer name="block_1_project/Conv2D" type="Convolution" precision="FP32" id="10">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<biases offset="17344" size="96" />
				<weights offset="17440" size="9216" />
			</blobs>
		</layer>
		<layer name="block_2_expand/Conv2D" type="Convolution" precision="FP32" id="11">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<biases offset="26656" size="576" />
				<weights offset="27232" size="13824" />
			</blobs>
		</layer>
		<layer name="block_2_expand_relu/Relu6" type="Clamp" precision="FP32" id="12">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer name="block_2_depthwise/depthwise" type="Convolution" precision="FP32" id="13">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<biases offset="41056" size="576" />
				<weights offset="41632" size="5184" />
			</blobs>
		</layer>
		<layer name="block_2_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="14">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer name="block_2_project/Conv2D" type="Convolution" precision="FP32" id="15">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<biases offset="46816" size="96" />
				<weights offset="46912" size="13824" />
			</blobs>
		</layer>
		<layer name="block_2_add/add" type="Eltwise" precision="FP32" id="16">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer name="block_3_expand/Conv2D" type="Convolution" precision="FP32" id="17">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<biases offset="60736" size="576" />
				<weights offset="61312" size="13824" />
			</blobs>
		</layer>
		<layer name="block_3_expand_relu/Relu6" type="Clamp" precision="FP32" id="18">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer name="block_3_depthwise/depthwise" type="Convolution" precision="FP32" id="19">
			<data dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="0,0" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="75136" size="576" />
				<weights offset="75712" size="5184" />
			</blobs>
		</layer>
		<layer name="block_3_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="20">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="block_3_project/Conv2D" type="Convolution" precision="FP32" id="21">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="80896" size="128" />
				<weights offset="81024" size="18432" />
			</blobs>
		</layer>
		<layer name="block_4_expand/Conv2D" type="Convolution" precision="FP32" id="22">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="99456" size="768" />
				<weights offset="100224" size="24576" />
			</blobs>
		</layer>
		<layer name="block_4_expand_relu/Relu6" type="Clamp" precision="FP32" id="23">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="block_4_depthwise/depthwise" type="Convolution" precision="FP32" id="24">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="124800" size="768" />
				<weights offset="125568" size="6912" />
			</blobs>
		</layer>
		<layer name="block_4_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="25">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="block_4_project/Conv2D" type="Convolution" precision="FP32" id="26">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="132480" size="128" />
				<weights offset="132608" size="24576" />
			</blobs>
		</layer>
		<layer name="block_4_add/add" type="Eltwise" precision="FP32" id="27">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="block_5_expand/Conv2D" type="Convolution" precision="FP32" id="28">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="157184" size="768" />
				<weights offset="157952" size="24576" />
			</blobs>
		</layer>
		<layer name="block_5_expand_relu/Relu6" type="Clamp" precision="FP32" id="29">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="block_5_depthwise/depthwise" type="Convolution" precision="FP32" id="30">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="182528" size="768" />
				<weights offset="183296" size="6912" />
			</blobs>
		</layer>
		<layer name="block_5_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="31">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="block_5_project/Conv2D" type="Convolution" precision="FP32" id="32">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="190208" size="128" />
				<weights offset="190336" size="24576" />
			</blobs>
		</layer>
		<layer name="block_5_add/add" type="Eltwise" precision="FP32" id="33">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="block_6_expand/Conv2D" type="Convolution" precision="FP32" id="34">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="214912" size="768" />
				<weights offset="215680" size="24576" />
			</blobs>
		</layer>
		<layer name="block_6_expand_relu/Relu6" type="Clamp" precision="FP32" id="35">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="block_6_depthwise/depthwise" type="Convolution" precision="FP32" id="36">
			<data dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="0,0" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="240256" size="768" />
				<weights offset="241024" size="6912" />
			</blobs>
		</layer>
		<layer name="block_6_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="37">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_6_project/Conv2D" type="Convolution" precision="FP32" id="38">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="247936" size="256" />
				<weights offset="248192" size="49152" />
			</blobs>
		</layer>
		<layer name="block_7_expand/Conv2D" type="Convolution" precision="FP32" id="39">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="297344" size="1536" />
				<weights offset="298880" size="98304" />
			</blobs>
		</layer>
		<layer name="block_7_expand_relu/Relu6" type="Clamp" precision="FP32" id="40">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_7_depthwise/depthwise" type="Convolution" precision="FP32" id="41">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="397184" size="1536" />
				<weights offset="398720" size="13824" />
			</blobs>
		</layer>
		<layer name="block_7_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="42">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_7_project/Conv2D" type="Convolution" precision="FP32" id="43">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="412544" size="256" />
				<weights offset="412800" size="98304" />
			</blobs>
		</layer>
		<layer name="block_7_add/add" type="Eltwise" precision="FP32" id="44">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_8_expand/Conv2D" type="Convolution" precision="FP32" id="45">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="511104" size="1536" />
				<weights offset="512640" size="98304" />
			</blobs>
		</layer>
		<layer name="block_8_expand_relu/Relu6" type="Clamp" precision="FP32" id="46">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_8_depthwise/depthwise" type="Convolution" precision="FP32" id="47">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="610944" size="1536" />
				<weights offset="612480" size="13824" />
			</blobs>
		</layer>
		<layer name="block_8_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="48">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_8_project/Conv2D" type="Convolution" precision="FP32" id="49">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="626304" size="256" />
				<weights offset="626560" size="98304" />
			</blobs>
		</layer>
		<layer name="block_8_add/add" type="Eltwise" precision="FP32" id="50">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_9_expand/Conv2D" type="Convolution" precision="FP32" id="51">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="724864" size="1536" />
				<weights offset="726400" size="98304" />
			</blobs>
		</layer>
		<layer name="block_9_expand_relu/Relu6" type="Clamp" precision="FP32" id="52">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_9_depthwise/depthwise" type="Convolution" precision="FP32" id="53">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="824704" size="1536" />
				<weights offset="826240" size="13824" />
			</blobs>
		</layer>
		<layer name="block_9_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="54">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_9_project/Conv2D" type="Convolution" precision="FP32" id="55">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="840064" size="256" />
				<weights offset="840320" size="98304" />
			</blobs>
		</layer>
		<layer name="block_9_add/add" type="Eltwise" precision="FP32" id="56">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_10_expand/Conv2D" type="Convolution" precision="FP32" id="57">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="938624" size="1536" />
				<weights offset="940160" size="98304" />
			</blobs>
		</layer>
		<layer name="block_10_expand_relu/Relu6" type="Clamp" precision="FP32" id="58">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_10_depthwise/depthwise" type="Convolution" precision="FP32" id="59">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1038464" size="1536" />
				<weights offset="1040000" size="13824" />
			</blobs>
		</layer>
		<layer name="block_10_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="60">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_10_project/Conv2D" type="Convolution" precision="FP32" id="61">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1053824" size="384" />
				<weights offset="1054208" size="147456" />
			</blobs>
		</layer>
		<layer name="block_11_expand/Conv2D" type="Convolution" precision="FP32" id="62">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1201664" size="2304" />
				<weights offset="1203968" size="221184" />
			</blobs>
		</layer>
		<layer name="block_11_expand_relu/Relu6" type="Clamp" precision="FP32" id="63">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_11_depthwise/depthwise" type="Convolution" precision="FP32" id="64">
			<data auto_pad="same_upper" dilations="1,1" group="576" kernel="3,3" output="576" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1425152" size="2304" />
				<weights offset="1427456" size="20736" />
			</blobs>
		</layer>
		<layer name="block_11_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="65">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_11_project/Conv2D" type="Convolution" precision="FP32" id="66">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1448192" size="384" />
				<weights offset="1448576" size="221184" />
			</blobs>
		</layer>
		<layer name="block_11_add/add" type="Eltwise" precision="FP32" id="67">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_12_expand/Conv2D" type="Convolution" precision="FP32" id="68">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1669760" size="2304" />
				<weights offset="1672064" size="221184" />
			</blobs>
		</layer>
		<layer name="block_12_expand_relu/Relu6" type="Clamp" precision="FP32" id="69">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_12_depthwise/depthwise" type="Convolution" precision="FP32" id="70">
			<data auto_pad="same_upper" dilations="1,1" group="576" kernel="3,3" output="576" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1893248" size="2304" />
				<weights offset="1895552" size="20736" />
			</blobs>
		</layer>
		<layer name="block_12_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="71">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_12_project/Conv2D" type="Convolution" precision="FP32" id="72">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1916288" size="384" />
				<weights offset="1916672" size="221184" />
			</blobs>
		</layer>
		<layer name="block_12_add/add" type="Eltwise" precision="FP32" id="73">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_13_expand/Conv2D" type="Convolution" precision="FP32" id="74">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2137856" size="2304" />
				<weights offset="2140160" size="221184" />
			</blobs>
		</layer>
		<layer name="block_13_expand_relu/Relu6" type="Clamp" precision="FP32" id="75">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="block_13_depthwise/depthwise" type="Convolution" precision="FP32" id="76">
			<data dilations="1,1" group="576" kernel="3,3" output="576" pads_begin="0,0" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2361344" size="2304" />
				<weights offset="2363648" size="20736" />
			</blobs>
		</layer>
		<layer name="block_13_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="77">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="block_13_project/Conv2D" type="Convolution" precision="FP32" id="78">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="160" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2384384" size="640" />
				<weights offset="2385024" size="368640" />
			</blobs>
		</layer>
		<layer name="block_14_expand/Conv2D" type="Convolution" precision="FP32" id="79">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="960" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2753664" size="3840" />
				<weights offset="2757504" size="614400" />
			</blobs>
		</layer>
		<layer name="block_14_expand_relu/Relu6" type="Clamp" precision="FP32" id="80">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="block_14_depthwise/depthwise" type="Convolution" precision="FP32" id="81">
			<data auto_pad="same_upper" dilations="1,1" group="960" kernel="3,3" output="960" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3371904" size="3840" />
				<weights offset="3375744" size="34560" />
			</blobs>
		</layer>
		<layer name="block_14_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="82">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="block_14_project/Conv2D" type="Convolution" precision="FP32" id="83">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="160" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3410304" size="640" />
				<weights offset="3410944" size="614400" />
			</blobs>
		</layer>
		<layer name="block_14_add/add" type="Eltwise" precision="FP32" id="84">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>160</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="block_15_expand/Conv2D" type="Convolution" precision="FP32" id="85">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="960" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4025344" size="3840" />
				<weights offset="4029184" size="614400" />
			</blobs>
		</layer>
		<layer name="block_15_expand_relu/Relu6" type="Clamp" precision="FP32" id="86">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="block_15_depthwise/depthwise" type="Convolution" precision="FP32" id="87">
			<data auto_pad="same_upper" dilations="1,1" group="960" kernel="3,3" output="960" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4643584" size="3840" />
				<weights offset="4647424" size="34560" />
			</blobs>
		</layer>
		<layer name="block_15_depthwise_relu/Relu6" type="Clamp" precision="FP32" id="88">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="block_15_project/Conv2D" type="Convolution" precision="FP32" id="89">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="160" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4681984" size="640" />
				<weights offset="4682624" size="614400" />
			</blobs>
		</layer>
		<layer name="block_15_add/add" type="Eltwise" precision="FP32" id="90">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>160</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>160</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="block_16_expand/Conv2D" type="Convolution" precision="FP32" id="91">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="960" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>160</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="5297024" size="3840" />
				<weights offset="5300864" size="614400" />
			</blobs>
		</layer>
		<layer name="block_16_expand_relu/Relu6" type="Clamp" precision="FP32" id="92">
			<data max="6.000000" min="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="block_16_depthwise/depthwise" type="Convolution" precision="FP32" id="93">
			<data auto_pad="same_upper" dilations="1,1" group="960" kernel="3,3" output="960" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
